DataProcessors/ФССП_ЗапросВФССП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ФССП_ЗапросВФССП</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРегиона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>task</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Documents/ФССП_ЗагрузкаИсполнительногоПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ФССП_ЗагрузкаИсполнительногоПроизводства</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ФССП_СостояниеИП</xr:Item>
				<xr:Item>AccumulationRegister.ФССП_ЗадолженностьПоИП</xr:Item>
				<xr:Item>AccumulationRegister.ФССП_ЗадолженностьПоПредметамИП</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>task</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>тчИсполнительныеПроизводства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>name</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>exe_production</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>details</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>subject</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ip_end</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>bailiff</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>department</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтделСудебныхПриставов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФССП_СлужбыСудебныхПриставов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СудебныйПриставИсполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СудебныеПриставы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОкончания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предмет1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФССП_ПредметыИП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предмет2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФССП_ПредметыИП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предмет3</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФССП_ПредметыИП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предмет4</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФССП_ПредметыИП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предмет5</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФССП_ПредметыИП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма5</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВозбуждения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИД</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОрганВыдавшийИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидИД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФССП_ТипыИсполнительныхДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ФССП_ЗапросВФССП/Forms/ФормаЗапроса/Ext/Form/Module.bsl
&НаСервере
Процедура ДолжникПриИзмененииНаСервере()
	бит_ФССП_Переопределяемый.ЗаполнитьЗапрос(Объект.Должник,Объект.Фамилия,Объект.Имя,Объект.Отчество,Объект.ДатаРождения,Объект.КодРегиона);
КонецПроцедуры


&НаКлиенте
Процедура ДолжникПриИзменении(Элемент)
	ДолжникПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПолучитьНомерЗаданияНаСервере()
	Если ЗначениеЗаполнено(Объект.Должник) Тогда
		Если Объект.КодРегиона = 0 Или Объект.ДатаРождения = Дата(1,1,1) Тогда
			Сообщить ("Не удалось определить данные должника! Проверьте настройки констант ФССП!");
			Возврат;
		Иначе
			Объект.task=бит_ФССП_ИнтеграцияФССП.СоздатьЕдиничныйЗапрос(Объект.Должник,Объект.Фамилия,Объект.Имя,Объект.Отчество,Объект.ДатаРождения,Объект.КодРегиона);
		КонецЕсли;
	Иначе 
		Сообщить("Сначала выберете должника для запроса!");
		Возврат;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПолучитьНомерЗадания(Команда)
	ПолучитьНомерЗаданияНаСервере();
КонецПроцедуры


&НаСервере
Процедура ОбработатьЗаданиеНаСервере(МассивИП,ТекПользователь,Готово)
	ДолжникИП = бит_ФССП_ИнтеграцияФССП.ОбработатьЕдиничноеЗадание(Объект.task);
	Если ДолжникИП = Неопределено Тогда
		Готово = Ложь;
		Возврат;
	КонецЕсли;
	Долж = Объект.Должник;
	Для Каждого ИП из ДолжникИП Цикл
		МассивИП = бит_ФССП_ИнтеграцияФССП.ЗаполнитьДанныеДокумента(ИП,Долж,Ложь);
	КонецЦикла;
	Готово = Истина;
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьЗадание(Команда)
	ДлительнаяОперация = ВыполнитьФоновоеЗаданиеНаСервере();
    ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
    
    // указываем необходимость вывода прогресса состояния
    ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
    
    // указываем интервал обновления состояния в секундах, если не указать, 
    // то интервал будет увеличиваться при каждой итерации в 1.4 раза.
    ПараметрыОжидания.Интервал = 2;
    
    ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,Новый ОписаниеОповещения("ВыполнитьПроцедуруФоновоВыполнено", ЭтотОбъект),ПараметрыОжидания);
КонецПроцедуры

&НаСервере
Функция ВыполнитьФоновоеЗаданиеНаСервере()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Задание",объект.task);
	СтруктураПараметров.Вставить("ОбработкаЗакончена",Ложь);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'ОбработатьПрогрессЕдиничного'");
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне("Бит_ФССП_ИнтеграцияФССП.ОбработатьПрогрессЕдиничного",СтруктураПараметров,ПараметрыВыполнения);
	Возврат ДлительнаяОперация;
КонецФункции

&НаКлиенте
Процедура ВыполнитьПроцедуруФоновоВыполнено(Результат, ДополнительныеПараметры) Экспорт
	МассивИП="";
	ТекПользователь = "";
	Готово = Ложь; 
	Если Результат = Неопределено Тогда
		Возврат;
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
	ИначеЕсли Результат.Статус = "Выполнено" Тогда
		МассивИП = "";
		ТекПользователь = "";
		Обработано = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		Если Обработано Тогда
			ОбработатьЗаданиеНаСервере(МассивИП,ТекПользователь,Готово);
			Если Готово Тогда
				СоздатьДокументЗагрузкаИП(Объект.task, Объект.Должник, МассивИП,ТекПользователь);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры



&НаКлиенте
Процедура СоздатьДокументЗагрузкаИП(Задание, Должник, МассивИП,ТекПользователь);
	//МассивИП = ФССП_ОбщийМодуль_ИнтеграцияФССП.ЗаполнитьДанныеДокумента(МассивИППервичный,Должник,Ложь);
	
	
	//ДокументОбъект = Документы.ФССП_ЗагрузкаИсполнительногоПроизводства.СоздатьДокумент();
	ФормаДокумент = ПолучитьФорму("Документ.ФССП_ЗагрузкаИсполнительногоПроизводства.Форма.ФормаДокумента", , ЭтаФорма);
	ФормаДокумент.Объект.Должник = Должник;
	ФормаДокумент.Объект.task = Задание;
	ФормаДокумент.Объект.Дата = ОбщегоНазначенияКлиент.ДатаСеанса();
	ФормаДокумент.Объект.Автор = ТекПользователь;
	
	Для Каждого ип из МассивИП Цикл
		стр = ФормаДокумент.Объект.тчИсполнительныеПроизводства.Добавить();
		ЗаполнитьЗначенияСвойств(стр,ИП);
	КонецЦикла;
	Для Каждого стр из ФормаДокумент.Объект.тчИсполнительныеПроизводства Цикл 
		стр.bailiff = стрЗаменить(стр.bailiff, "<br>", " ");
		стр.bailiff= стрЗаменить(стр.bailiff, "<br/>", " ");
	КонецЦикла;	
	ФормаДокумент.Открыть();
	
КонецПроцедуры
